## Statistics

In [1]:
import pandas as pd

In [2]:
df=pd.read_excel(r"C:\Users\hp\Downloads\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad           28.0          60     Sunny
1 2025-01-02    Hyderbad           29.0          62     Sunny
2 2025-01-03    Hyderbad            NaN          58    Cloudy
3 2025-01-04    Hyderbad           31.0          55    Cloudy
4 2025-01-05    Banglore            NaN          57     Rainy
5 2025-01-06    Banglore           33.0          59     Rainy
6 2025-01-07    Banglore           34.0          61     Sunny
7 2025-01-08    Banglore           32.0          63    Cloudy
8 2025-01-09  Vijayawada            NaN          64     Rainy
9 2025-01-10  Vijayawada           29.0          62     Sunny

In [3]:
df['Temperature_C'].max()

34.0

In [4]:
df['Temperature_C'].min()

28.0

In [9]:
df['Temperature_C'].mean()

np.float64(30.9)

In [5]:
df.Temperature_C.mean()

np.float64(30.857142857142858)

In [6]:
df.Temperature_C.median()

31.0

In [7]:
df['Temperature_C'].mode()

0    29.0
Name: Temperature_C, dtype: float64

In [8]:
df['Temperature_C'].describe()

count     7.000000
mean     30.857143
std       2.267787
min      28.000000
25%      29.000000
50%      31.000000
75%      32.500000
max      34.000000
Name: Temperature_C, dtype: float64

In [9]:
df['Temperature_C'].std()

2.2677868380553634

In [10]:
df['Temperature_C'].var()

5.142857142857143

In [11]:
df['Temperature_C'].sum()

np.float64(216.0)

In [12]:
df['Temperature_C'].count()

np.int64(7)

In [13]:
df['Humidity_%'].count()

np.int64(10)

In [14]:
df['Humidity_%'].sum()

np.int64(601)

In [15]:
df['Humidity_%'].mean()

np.float64(60.1)

In [16]:
df['Humidity_%'].median()

60.5

In [17]:
df['Humidity_%'].mode()

0    62
Name: Humidity_%, dtype: int64

In [18]:
df['Humidity_%'].describe()

count    10.00000
mean     60.10000
std       2.84605
min      55.00000
25%      58.25000
50%      60.50000
75%      62.00000
max      64.00000
Name: Humidity_%, dtype: float64

In [19]:
df['Humidity_%'].var()

8.100000000000001

In [20]:
df[df.Temperature_C == df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore           34.0          61     Sunny

In [21]:
df.City[df.Temperature_C == df.Temperature_C.max()]

6    Banglore
Name: City, dtype: object

In [22]:
df.count()

Date             10
City             10
Temperature_C     7
Humidity_%       10
Condition        10
dtype: int64

In [23]:
df["City"].nunique()

3

In [24]:
df['City'].value_counts()

City
Hyderbad      4
Banglore      4
Vijayawada    2
Name: count, dtype: int64

## String Cleaning

In [25]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad           28.0          60     Sunny
1 2025-01-02    Hyderbad           29.0          62     Sunny
2 2025-01-03    Hyderbad            NaN          58    Cloudy
3 2025-01-04    Hyderbad           31.0          55    Cloudy
4 2025-01-05    Banglore            NaN          57     Rainy
5 2025-01-06    Banglore           33.0          59     Rainy
6 2025-01-07    Banglore           34.0          61     Sunny
7 2025-01-08    Banglore           32.0          63    Cloudy
8 2025-01-09  Vijayawada            NaN          64     Rainy
9 2025-01-10  Vijayawada           29.0          62     Sunny

In [26]:
df['City'] = df['City'].str.lower()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    hyderbad           28.0          60     Sunny
1 2025-01-02    hyderbad           29.0          62     Sunny
2 2025-01-03    hyderbad            NaN          58    Cloudy
3 2025-01-04    hyderbad           31.0          55    Cloudy
4 2025-01-05    banglore            NaN          57     Rainy
5 2025-01-06    banglore           33.0          59     Rainy
6 2025-01-07    banglore           34.0          61     Sunny
7 2025-01-08    banglore           32.0          63    Cloudy
8 2025-01-09  vijayawada            NaN          64     Rainy
9 2025-01-10  vijayawada           29.0          62     Sunny

In [27]:
df['City'] = df['City'].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD           28.0          60     Sunny
1 2025-01-02    HYDERBAD           29.0          62     Sunny
2 2025-01-03    HYDERBAD            NaN          58    Cloudy
3 2025-01-04    HYDERBAD           31.0          55    Cloudy
4 2025-01-05    BANGLORE            NaN          57     Rainy
5 2025-01-06    BANGLORE           33.0          59     Rainy
6 2025-01-07    BANGLORE           34.0          61     Sunny
7 2025-01-08    BANGLORE           32.0          63    Cloudy
8 2025-01-09  VIJAYAWADA            NaN          64     Rainy
9 2025-01-10  VIJAYAWADA           29.0          62     Sunny

In [29]:
df['Condition'] = df['Condition'].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI           28.0          60     SUNNY
1 2025-01-02     CHENNAI           29.0          62     SUNNY
2 2025-01-03     CHENNAI            NaN          58    CLOUDY
3 2025-01-04     CHENNAI           31.0          55    CLOUDY
4 2025-01-05    BANGLORE            NaN          57     RAINY
5 2025-01-06    BANGLORE           33.0          59     RAINY
6 2025-01-07    BANGLORE           34.0          61     SUNNY
7 2025-01-08    BANGLORE           32.0          63    CLOUDY
8 2025-01-09  VIJAYAWADA            NaN          64     RAINY
9 2025-01-10  VIJAYAWADA           29.0          62     SUNNY

In [28]:
df["City"]=df["City"].str.replace("HYDERBAD","CHENNAI")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI           28.0          60     Sunny
1 2025-01-02     CHENNAI           29.0          62     Sunny
2 2025-01-03     CHENNAI            NaN          58    Cloudy
3 2025-01-04     CHENNAI           31.0          55    Cloudy
4 2025-01-05    BANGLORE            NaN          57     Rainy
5 2025-01-06    BANGLORE           33.0          59     Rainy
6 2025-01-07    BANGLORE           34.0          61     Sunny
7 2025-01-08    BANGLORE           32.0          63    Cloudy
8 2025-01-09  VIJAYAWADA            NaN          64     Rainy
9 2025-01-10  VIJAYAWADA           29.0          62     Sunny